#+TODO: TODO | DONE
#+TODO: MUST-SEE | SAW
#+TODO: FAIL | GOAL DONE

* Planes

** Targets on Week

*** TODO Run the main file of the project in =run-command-reicpes= :run_command_recipes:

*** TODO =racket-mmanager=

*** TODO Complete ICT of the =MIPT=
DEADLINE: <2022-10-06 -20d Чт>

*** TODO explore the =xetex=                                          :latex:

*** TODO add support of the =org-export= to the =run-command-recipes= :run_command_recipes:
*** TODO Xenops in non \documentclass =LaTeX= documents
SCHEDULED: <2022-09-24 Сб>

*** TODO New =embrace= with support of the =smartparens=
SCHEDULED: <2022-09-24 Сб>

*** TODO Impatient modes for all =major-modes=
SCHEDULED: <2022-09-24 Сб>

*** TODO Fix =my-copy-buffer-content-as-mipt-solution=
SCHEDULED: <2022-09-24 Сб>

*** TODO More useful way to run =run-command-recipes= recipes
SCHEDULED: <2022-09-24 Сб>



See on the compile command from the =latex-extra=
*** TODO Keys for the centering =org-mode= table columns
SCHEDULED: <2022-09-24 Сб>

*** TODO Live evaluating of the =org-mode= table formulas
SCHEDULED: <2022-09-24 Сб>

*** TODO From the =use-package= to the =leaf=
SCHEDULED: <2022-09-24 Сб>

*** TODO From the =org-mode= configuration to the pure =elisp= config
SCHEDULED: <2022-09-24 Сб>

Should be byte-compile clearly
*** TODO Fix the /f/ key binding for the =org-speed-keys=
SCHEDULED: <2022-09-24 Сб>
*** TODO Kill =sp-kill-whole-line=
SCHEDULED: <2022-09-24 Сб>
*** TODO Post commit hook for Emacs.org (delete DONE =org-mode= heading)
** Targets on Day
SCHEDULED: <2022-09-24 Сб>

*** TODO Use =latex-extra-run-all= in the =org-export=
SCHEDULED: <2022-09-24 Сб>

*** TODO Command for the =org-mode= options setting
SCHEDULED: <2022-09-24 Сб>

*** DONE Fix =org-speed-commands= at beginning of the buffer
SCHEDULED: <2022-09-24 Сб>

*** DONE Function for the openning of the MIPT task web-page
SCHEDULED: <2022-09-24 Сб>

*** TODO Map for =deft= integrated with =xah-fly-keys=
SCHEDULED: <2022-09-24 Сб>

*** DONE New events for the =auto-save=
SCHEDULED: <2022-09-24 Сб>


For example =dired-jump=
SCHEDULED: <2022-09-24 Сб>

*** DONE Fix coding
SCHEDULED: <2022-09-24 Сб>

*** DONE More pretty =helm-projectile-files=
*** DONE Finish =org= captures by =SPC ;=
SCHEDULED: <2022-09-23 Пт>

*** DONE Enable =paxedit= in lisp modes
SCHEDULED: <2022-09-23 Пт>

*** DONE Change/delete obsolete fragments of the config
SCHEDULED: <2022-09-23 Пт>
=import= and =nav=

*** TODO Fix =xah-fly-keys= in =calc=
SCHEDULED: <2022-09-23 Пт>

*** DONE Fix the =LaTEX= section insertion
SCHEDULED: <2022-09-23 Пт>

*** DONE Keybinding =SPC l z= for =peaxedit=
SCHEDULED: <2022-09-23 Пт>

*** DONE Color Picker
SCHEDULED: <2022-09-23 Пт>

*** DONE Auto capitalize on #+TITLE in org
SCHEDULED: <2022-09-23 Пт>

*** DONE Latex expansion : wrapfig, wraptable
SCHEDULED: <2022-09-23 Пт>

*** DONE Multicolumn expansion latex
SCHEDULED: <2022-09-23 Пт>

*** DONE Change defnition of =insert-new-counter=
SCHEDULED: <2022-09-22 Чт>

*** DONE View list of possible LaTeX expansion
SCHEDULED: <2022-09-22 Чт>
SCHEDULED: <2022-09-22 Чт>

*** DONE Enable prettify mode in latex
SCHEDULED: <2022-09-22 Чт>
SCHEDULED: <2022-09-22 Чт>

*** DONE Print current buffer command for =fast-exec=
* Films 

** MUST-SEE Thor: Love and Thunder
   :PROPERTIES:
   :name:     Тор: Любовь и гром
   :year:     2022
   :slogan:   Not every god has a plan.
   :id:       1282688
   :rating:   65.0
   :countries: (Австралия США)
   :END:

** MUST-SEE The Batman
   :PROPERTIES:
   :name:     Бэтмен
   :year:     2022
   :slogan:   Unmask The Truth
   :id:       590286
   :rating:   79.0
   :countries: (США)
   :END:

** SAW Sound of Metal
   :PROPERTIES:
   :name:     Звук металла
   :year:     2019
   :slogan:   Music was his world. Then silence revealed a new one.
   :id:       957883
   :rating:   73.0
   :countries: (Бельгия США)
   :END:

** MUST-SEE Missionary: Impossible
   :PROPERTIES:
   :name:     Миссия невыполнима
   :year:     2006
   :slogan:   nil
   :id:       305389
   :rating:   0
   :countries: (США)
   :END:

** MUST-SEE Doctor Strange in the Multiverse of Madness
   :PROPERTIES:
   :name:     Доктор Стрэндж: В мультивселенной безумия
   :year:     2022
   :slogan:   Enter a new dimension of Strange.
   :id:       1219909
   :rating:   67.0
   :countries: (США)
   :END:

** SAW Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan
   :PROPERTIES:
   :name:     Борат
   :year:     2006
   :slogan:   Come to Kazakhstan, It's Nice!
   :id:       102474
   :rating:   67.0
   :countries: (Великобритания США)
   :END:

** MUST-SEE Raiders of the Lost Ark
:PROPERTIES:
:name:     Индиана Джонс: В поисках утраченного ковчега
:year:     1981
:slogan:   Indiana Jones - the new hero from the creators of JAWS and STAR WARS
:id:       339
:rating:   80.0
:countries: (США)
:END:



|           a | name | index |  an | 0     |
|-------------+------+-------+-----+-------|
| 4.5 + x / 4 |    2 |     4 |   6 | 6 + x |
|         4.5 |    9 |     0 |   8 | 6 + x |
|       205.5 |   90 |   300 | 431 | 6 + x |
#+TBLFM: $1=vmean($2..$5)::$5=6+x
** SAW Dumb and Dumber
:PROPERTIES:
:name:     Тупой и еще тупее
:year:     1994
:slogan:   Для них каждый новый день безумнее предыдущего
:id:       5185
:rating:   72.0
:countries: (США)
:END:
** MUST-SEE The Matrix Resurrections
:PROPERTIES:
:name:     Матрица: Воскрешение
:year:     2021
:slogan:   Выбор за тобой
:id:       1294123
:rating:   58.0
:countries: (Австралия США)
:END:
** MUST-SEE Gladiator
:PROPERTIES:
:name:     Гладиатор
:year:     2000
:slogan:   Генерал, ставший рабом. Раб, ставший гладиатором. Гладиатор, бросивший вызов империи
:id:       474
:rating:   86.0
:countries: (Великобритания Мальта Марокко США)
:END:

